{
  "title": "Greek Lexemes: Detailed Definitions",
  "lexemes": [
    {
      "word": "ἀπεκδέχομαι",
      "transliteration": "apekdechomai",
      "strongs": "G553",
      "pronunciation": "ap-ek-DEKH-om-ahee",
      "root_meaning": "To await eagerly, to expect with intensity",
      "etymology": "Compound: ἀπό (from) + ἐκ (out of) + δέχομαι (to receive). The double preposition (apo + ek) intensifies the verb—'to receive out from' with great anticipation.",
      "semantic_range": [
        "To await eagerly",
        "To expect earnestly",
        "To wait with focused anticipation"
      ],
      "primary_theological_meaning": "To eagerly await with confident expectation, especially of eschatological fulfillment",
      "grammatical_classification": "Middle/Passive Deponent - always appears in middle/passive form but with active meaning",
      "usage_pattern": "Primarily Pauline and used almost exclusively for eschatological waiting—awaiting Christ's return, resurrection, redemption. Always carries intensity and confidence.",
      "theological_significance": "Apekdechomai is the NT's premier word for Christian eschatological hope. The double compound creates intensity—this is not casual waiting but eager, confident, focused anticipation. It's the posture of the Church between Ascension and Parousia—living on tiptoe, awaiting the fulfillment.",
      "distinctive_features": [
        "Most frequent Greek word in our study (6 occurrences)",
        "Exclusively eschatological contexts",
        "Always middle/passive deponent (active meaning)",
        "Intense, eager connotation"
      ],
      "relationship_to_themes": {
        "eschatological_hope": "Primary context—awaiting Christ's return",
        "strength_renewal": "Hope of glorification sustains present trials",
        "help_deliverance": "Awaiting final deliverance",
        "blessing_inheritance": "Anticipating eternal inheritance"
      },
      "key_verses": [
        "Romans 8:19 - 'Creation itself eagerly awaits (apekdechomai) the revelation of the sons of God'",
        "Romans 8:23 - 'We eagerly await (apekdechomai) adoption as sons, the redemption of our bodies'",
        "Romans 8:25 - 'If we hope for what we do not see, we eagerly await (apekdechomai) it with patience'",
        "1 Corinthians 1:7 - 'Eagerly awaiting (apekdechomai) the revelation of our Lord Jesus Christ'",
        "Philippians 3:20 - 'We eagerly await (apekdechomai) a Savior from there, the Lord Jesus Christ'",
        "Hebrews 9:28 - 'To those who eagerly await (apekdechomai) Him, He will appear'"
      ],
      "contrast_with_other_words": "More intense and focused than προσδέχομαι (which can be general anticipation). Apekdechomai always implies eager, concentrated expectation. Unlike ὑπομονή (patient endurance), apekdechomai emphasizes forward-looking anticipation.",
      "morphological_note": "Appears in various persons and numbers, often in present tense (continuous eager awaiting) or future (will eagerly await). The middle voice fits the personal investment Christians have in Christ's return.",
      "pauline_usage": "Paul's favorite eschatological waiting word—appears 8x in NT, 6x by Paul. For Paul, Christian existence is defined by this eager anticipation of glory."
    },
    {
      "word": "προσδέχομαι",
      "transliteration": "prosdechomai",
      "strongs": "G4327",
      "pronunciation": "pros-DEKH-om-ahee",
      "root_meaning": "To receive to oneself, to accept, to wait for, to expect",
      "etymology": "Compound: πρός (toward) + δέχομαι (to receive). The idea is receiving toward oneself—welcoming or awaiting arrival.",
      "semantic_range": [
        "To receive",
        "To accept",
        "To wait for",
        "To expect",
        "To look for"
      ],
      "primary_theological_meaning": "To expectantly await, especially with readiness to receive",
      "grammatical_classification": "Middle/Passive Deponent - appears in middle/passive form with active meaning",
      "usage_pattern": "Used in both eschatological contexts (awaiting Messiah or kingdom) and general contexts (receiving people or expecting events). Often implies readiness and receptivity.",
      "theological_significance": "Prosdechomai emphasizes the readiness to receive what is awaited. It's not just waiting but waiting with open arms, prepared to welcome. In messianic contexts, it describes those who were actively looking for and ready to receive the Messiah.",
      "distinctive_features": [
        "4 occurrences in our study",
        "Strong messianic expectation theme",
        "Implies readiness to receive",
        "Middle deponent"
      ],
      "relationship_to_themes": {
        "messianic_expectation": "Primary usage—awaiting Messiah or kingdom",
        "eschatological_hope": "Looking for God's kingdom and consolation"
      },
      "key_verses": [
        "Mark 15:43 - 'Joseph of Arimathea, who was himself waiting (prosdechomai) for the kingdom of God'",
        "Luke 2:25 - 'Simeon was waiting (prosdechomai) for the consolation of Israel'",
        "Luke 2:38 - '[Anna spoke] to all who were waiting (prosdechomai) for the redemption of Jerusalem'"
      ],
      "contrast_with_other_words": "Less intense than ἀπεκδέχομαι but implies more active readiness to receive than ἀναμένω. The 'toward' (pros) prefix suggests movement toward reception.",
      "morphological_note": "Appears primarily in imperfect tense (continuous action in past) describing the ongoing posture of Jewish faithful awaiting Messiah before His coming.",
      "gospel_usage": "Particularly prominent in Luke's Gospel, describing the pious remnant in Israel who actively awaited God's redemptive action."
    },
    {
      "word": "μακροθυμέω",
      "transliteration": "makrothymeō",
      "strongs": "G3114",
      "pronunciation": "mak-roth-oo-MEH-oh",
      "root_meaning": "To be longsuffering, to be patient, to bear with",
      "etymology": "Compound: μακρός (long) + θυμός (anger/passion). Literally 'long-tempered' or 'far from wrath'—the opposite of short-tempered.",
      "semantic_range": [
        "To be patient",
        "To be longsuffering",
        "To forbear",
        "To endure with patience",
        "To wait patiently"
      ],
      "primary_theological_meaning": "To exercise patience by restraining anger or frustration, especially in face of provocation or delay",
      "grammatical_classification": "Active verb (not deponent)",
      "usage_pattern": "Used of both divine patience (God's forbearance toward sinners) and human patience (toward others or in circumstances). Often in contexts of endurance or forbearance.",
      "theological_significance": "Makrothymeō captures the self-restraint aspect of patience—not quick anger, not hasty judgment, but long-suffering endurance. It's patience as a moral virtue, restraining negative reaction. For waiting on God, it means not growing bitter or frustrated during delays.",
      "distinctive_features": [
        "1 occurrence in our study",
        "Emphasizes restraint and forbearance",
        "Related to the fruit of the Spirit (μακροθυμία)",
        "Active verb form"
      ],
      "relationship_to_themes": {
        "patience_endurance": "Core meaning—patient endurance without complaint"
      },
      "key_verses": [
        "James 5:7-8 - 'Be patient (makrothymeō), therefore, brothers, until the coming of the Lord... the farmer waits (makrothymeō) for the precious fruit of the earth, being patient (makrothymeō) about it'"
      ],
      "contrast_with_other_words": "While ὑπομονή (hypomonē) emphasizes steadfast endurance under trial, μακροθυμέω emphasizes restraint of negative emotion—long-suffering rather than steady endurance. Both are aspects of patience but with different emphases.",
      "morphological_note": "In James 5, appears in both imperative (command) and participle forms, showing both the command to patience and the characteristic posture of patient waiting.",
      "james_context": "James uses the farmer as illustration—agricultural waiting requires makrothymia, patient endurance without forcing premature harvest."
    },
    {
      "word": "ἀναμένω",
      "transliteration": "anamenō",
      "strongs": "G362",
      "pronunciation": "an-am-EN-oh",
      "root_meaning": "To wait for, to await",
      "etymology": "Compound: ἀνά (up, again) + μένω (to remain, abide). The idea is remaining in place looking upward or remaining until arrival.",
      "semantic_range": [
        "To wait for",
        "To await",
        "To remain waiting"
      ],
      "primary_theological_meaning": "To wait expectantly for someone's arrival or appearance",
      "grammatical_classification": "Active verb",
      "usage_pattern": "Rare word (only 1 NT occurrence). The 'ana' prefix may suggest upward looking or returning to a state of waiting.",
      "theological_significance": "Though rare, anamenō in its sole NT occurrence refers to awaiting Jesus from heaven—the posture of looking upward for Christ's return. The 'remaining' (menō) component suggests steadfast waiting, not wandering.",
      "distinctive_features": [
        "Only 1 occurrence in NT and in our study",
        "Rare word",
        "Active form",
        "Eschatological context"
      ],
      "relationship_to_themes": {
        "eschatological_hope": "Waiting for Christ's return from heaven"
      },
      "key_verses": [
        "1 Thessalonians 1:10 - 'To wait (anamenō) for His Son from heaven'"
      ],
      "contrast_with_other_words": "Less emphatic than ἀπεκδέχομαι but shares eschatological focus. The 'menō' (abide/remain) root suggests steadfastness in waiting position.",
      "morphological_note": "Appears as present infinitive in 1 Thessalonians 1:10, describing the continuous posture of Thessalonian believers.",
      "thessalonian_context": "Paul commends the Thessalonians for turning from idols 'to serve the living God and to wait for His Son from heaven'—defining marks of Christian conversion."
    },
    {
      "word": "ἐλπίζω",
      "transliteration": "elpizō",
      "strongs": "G1679",
      "pronunciation": "el-PID-zo",
      "root_meaning": "To hope, to expect, to trust in",
      "etymology": "Related to ἐλπίς (hope). The verbal form means 'to exercise hope' or 'to place hope in.'",
      "semantic_range": [
        "To hope",
        "To expect",
        "To trust",
        "To have confidence in",
        "To set hope on"
      ],
      "primary_theological_meaning": "To place one's hope or confidence in something or someone",
      "grammatical_classification": "Active verb",
      "usage_pattern": "Common in NT (31 occurrences). Used for both general hoping/expecting and specifically for Christian hope in God, Christ, or gospel promises.",
      "theological_significance": "Elpizō is the standard Greek word for Christian hope. It's not wishful thinking but confident expectation based on God's promises. To 'hope in God' is to trust His character and commit to His promises.",
      "distinctive_features": [
        "1 occurrence in our study",
        "Standard word for 'hope'",
        "Active verb",
        "Broad usage across NT"
      ],
      "relationship_to_themes": {
        "trust_hope": "Core meaning—placing trust and hope in God"
      },
      "key_verses": [
        "1 Corinthians 15:19 - 'If in Christ we have hoped (elpizō) in this life only, we are of all people most to be pitied'"
      ],
      "contrast_with_other_words": "Elpizō is the general term for hope; ἀπεκδέχομαι specifies eager, intense awaiting. Elpizō can be used for any object of hope; the compound verbs (apekdechomai, prosdechomai) are more specific to eschatological or messianic hope.",
      "morphological_note": "Appears in various tenses and forms. The noun form ἐλπίς (hope) is one of the great theological terms of the NT, part of the faith-hope-love triad.",
      "pauline_usage": "For Paul, Christian hope (elpis/elpizō) is not uncertain optimism but confident expectation of resurrection and glory based on Christ's resurrection."
    },
    {
      "word": "ὑπομονή",
      "transliteration": "hypomonē",
      "strongs": "G5281",
      "pronunciation": "hoop-om-on-AY",
      "root_meaning": "Patient endurance, steadfastness, perseverance",
      "etymology": "Compound: ὑπό (under) + μένω (to remain, abide). Literally 'remaining under'—staying under the burden without fleeing.",
      "semantic_range": [
        "Endurance",
        "Patience",
        "Perseverance",
        "Steadfastness",
        "Fortitude"
      ],
      "primary_theological_meaning": "Steadfast endurance under trial, difficulty, or waiting; active perseverance rather than passive resignation",
      "grammatical_classification": "Noun (feminine)",
      "usage_pattern": "Common in NT (32 occurrences). Often paired with tribulation, trial, or testing. One of the cardinal Christian virtues, especially in James, Romans, and Revelation.",
      "theological_significance": "Hypomonē is active, masculine endurance—not passive suffering but courageous remaining under pressure. It's the virtue of the martyr and the saint. In waiting contexts, it's the strength to maintain hope during extended delay without giving up. It's staying power.",
      "distinctive_features": [
        "1 occurrence in our study (noun form)",
        "Emphasis on endurance under pressure",
        "Active perseverance, not passive endurance",
        "Major NT virtue"
      ],
      "relationship_to_themes": {
        "patience_endurance": "Core meaning—steadfast endurance"
      },
      "key_verses": [
        "Romans 5:3-4 - 'Tribulation produces patience (hypomonē); and patience, character; and character, hope'",
        "James 1:3-4 - 'The testing of your faith produces patience (hypomonē). But let patience have its perfect work'",
        "Hebrews 12:1 - 'Let us run with endurance (hypomonē) the race set before us'",
        "Revelation 13:10 - 'Here is the patience (hypomonē) and faith of the saints'"
      ],
      "contrast_with_other_words": "While μακροθυμέω emphasizes restraint of anger (long-tempered), ὑπομονή emphasizes steadfast endurance under pressure (remaining under load). Both are patience, but hypomonē is more about strength under trial.",
      "morphological_note": "As a noun, it appears in various cases. The related verb ὑπομένω means 'to endure, remain, persevere.'",
      "theological_development": "In NT theology, hypomonē becomes a key virtue developed through trial and essential for Christian maturity. It's not natural but developed through tribulation and produces proven character.",
      "athletic_metaphor": "Often uses athletic metaphors (running the race with endurance). It's the strength to finish, not just to start."
    }
  ],
  "summary": {
    "most_frequent": "ἀπεκδέχομαι (apekdechomai) - 6 occurrences - Eager eschatological awaiting",
    "most_messianic": "προσδέχομαι (prosdechomai) - 4 occurrences - Awaiting Messiah with readiness",
    "most_forbearing": "μακροθυμέω (makrothymeō) - 1 occurrence - Longsuffering patience",
    "most_steadfast": "ὑπομονή (hypomonē) - 1 occurrence - Endurance under pressure",
    "general_hope": "ἐλπίζω (elpizō) - 1 occurrence - Standard word for hope/trust"
  },
  "thematic_overview": "Greek vocabulary for Christian waiting is dominated by eschatological anticipation (apekdechomai, anamenō) and messianic expectation (prosdechomai). The NT emphasis is on eager, forward-looking hope—not passive endurance but active anticipation. Yet patience (makrothymeō) and steadfast endurance (hypomonē) are also crucial, showing that Christian waiting involves both forward-looking hope and present perseverance. Waiting is dynamic—looking ahead while standing firm.",
  "hebrew_greek_contrast": "Hebrew waiting vocabulary emphasizes various postures and emotional states (silent, patient, yearning, tense). Greek vocabulary emphasizes forward-looking anticipation (especially eschatological) and steadfast endurance. Hebrew captures the psychology of waiting; Greek captures its teleology—waiting toward a definite end (Christ's return, kingdom coming)."
}
